frontend/controllers/ContactUsController.php

    public function actionIndex() {
        $app_info = AppInfo::find()->one();
---
SELECT * FROM `app_info`