frontend/controllers/SiteController.php

SELECT * FROM `app_info`
---
    public function actionIndex($cat=1,$t=0)
    {
        $app_info = AppInfo::find()->one();

SELECT * FROM `app_info`
---
    public  function actionAbout()
    {
        $model = AppInfo::find()->one();