frontend/controllers/ToolsController.php

    public function actionIndex()
    {

//        $this->layout = 'painting-layout';
        $searchModel = new ProductSearch();
        $query = Category::find()->andWhere(['status' =>ActiveInactiveStatus::active]);
        $categoriesDataProvider = new ActiveDataProvider([
            'query' => $query,
            'pagination' => [
                'pageSize' => 6,

            ],
        ]);
        $tools_offers = Product::find()
            ->andWhere(['product.type' => PaintingToolType::tool])
            ->andWhere(['product.status' => ActiveInactiveStatus::active])
            ->andWhere(['product.has_offer' => 1])
            ->all();
---
SELECT * FROM `product` WHERE (`product`.`type`=2) AND (`product`.`status`=1) AND (`product`.`has_offer`=1)