common/models/AppInfo.php

    public function afterFind()
    {
        //language
        $localizationModel = LocalizedAppInfo::find()
            ->andWhere(['lang' => api_lang()])
            ->andWhere(['item_id' => $this->id])
            ->one();
---
SELECT * FROM `localized_app_info` WHERE (`lang`='en') AND (`item_id`=1)