common/models/Category.php

    public function afterFind()
    {
        //language
        $localizationModel = LocalizedCategory::find()
            ->andWhere(['lang' => api_lang()])
            ->andWhere(['item_id' => $this->id])
            ->one();
---
SELECT * FROM `localized_category` WHERE (`lang`='en') AND (`item_id`=1)