common/models/Product.php

SELECT * FROM `localized_product` WHERE (`lang`='en') AND (`item_id`=30)
---
    public function afterFind()
    {
        //language
        $localizationModel = LocalizedProduct::find()
            ->andWhere(['lang' => api_lang()])
            ->andWhere(['item_id' => $this->id])
            ->one();