frontend/views/layouts/main.php

    <?= $content ?>

    <?php
    $app = AppInfo::find()->one();
---
SELECT * FROM `app_info`